---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ReinforcementData Properties
ReinforcementData Class See Also Send Feedback
---

The ReinforcementData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ReinforcementData Class

Autodesk.Revit.DB.Structure Namespace